#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:t broken-links:nil
#+options: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t toc:t
#+options: todo:t |:t
#+title: README-guix
#+date: <2022-02-04 Fri>
#+author: Gregory Grubbs
#+email: gregory.grubbs@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.2 (Org mode 9.5.2)
#+cite_export:
#+setupfile: ~/projects/emacs/org-html-themes/org/theme-readtheorg-local.setup
#+property: header-args:bash :comments org :shebang #!/usr/bin/env bash :eval never-export
* Package info by profile
  #+name: all-profiles
  #+begin_src bash :results output table replace
    echo 'System /run/current-system/profile'
    for p in $(guix package --list-profiles); do
        pname=$(basename ${p})
        echo "${pname} ${p}"
    done
  #+end_src

  #+RESULTS: all-profiles
  | System        | /run/current-system/profile                 |
  | code          | /home/gregj/.guix-extra-profiles/code       |
  | megillah      | /home/gregj/.guix-extra-profiles/megillah   |
  | multimedia    | /home/gregj/.guix-extra-profiles/multimedia |
  | python        | /home/gregj/.guix-extra-profiles/python     |
  | current       | /home/gregj/.config/guix/current            |
  | .guix-profile | /home/gregj/.guix-profile                   |
